app/controllers/application_controller.rb

  def home
  	@categories = Category.all
---
SELECT "categories".* FROM "categories"