app/controllers/categories_controller.rb

	def show
		#raise params.inspect
		@category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]