app/controllers/thoughts_controller.rb

	def index
		@thoughts = Thought.all
---
SELECT "thoughts".* FROM "thoughts"

	def show
		#raise params.inspect
		@thought = Thought.find(params[:id])
---
SELECT  "thoughts".* FROM "thoughts" WHERE "thoughts"."id" = ? LIMIT 1  [["id", 4]]

	def edit
		@thought = Thought.find(params[:id])
---
SELECT  "thoughts".* FROM "thoughts" WHERE "thoughts"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@thought = Thought.new(params[:thought])

		if @thought.save
---
INSERT INTO "thoughts" ("category_id", "author", "thought", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["author", "saul"], ["thought", "any thought"], ["created_at", "2016-10-12 01:18:41.216325"], ["updated_at", "2016-10-12 01:18:41.216325"]]

	def update
		@thought = Thought.find(params[:id])

		if @thought.update(params[:thought])
---
SELECT  "thoughts".* FROM "thoughts" WHERE "thoughts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "thoughts" SET "category_id" = ?, "author" = ?, "updated_at" = ? WHERE "thoughts"."id" = ?  [["category_id", 111], ["author", "asdfasdfasdf"], ["updated_at", "2016-10-12 01:51:08.851303"], ["id", 1]]

	def destroy
		@thought = Thought.destroy(params[:id])
---
DELETE FROM "thoughts" WHERE "thoughts"."id" = ?  [["id", 1]]